**This is just a practice project to refresh basic skills. The data is acquired from a book that I have been reading named `Models of Learning and Optimization for Data Scientists`. The link to the data is published on the book.**

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [7]:
# lets get the data
df = pd.read_csv('best-pictures.csv')

In [8]:
# lets take a look at the data
df

,name,year,nominations,rating,duration,genre1,genre2,release,synopsis
0,The Shape of Water,2017,13,7.4,123,Fantasy,Drama,August,At a top secret research facility in the 1960s...
1,Moonlight,2016,8,7.5,111,Drama,NaN,November,A chronicle of the childhood; adolescence and ...
2,Spotlight,2015,6,8.1,128,Crime,Drama,November,The true story of how the Boston Globe uncover...
3,Birdman,2014,9,7.8,119,Comedy,Drama,November,Illustrated upon the progress of his latest Br...
4,12 Years a Slave,2013,9,8.1,134,Biography,Drama,November,In the antebellum United States Solomon Northu...
...,...,...,...,...,...,...,...,...,...
85,Grand Hotel,1931,1,7.6,112,Drama,Romance,September,A group of very different individuals staying ...
86,Cimarron,1930,7,6.0,123,Drama,Western,February,A newspaper editor settles in an Oklahoma boom...
87,All Quiet on the Western Front,1929,4,8.1,136,Drama,War,August,A young soldier faces profound disillusionment...
88,The Broadway Melody,1928,3,6.4,100,Musical,Romance,June,Harriet and Queenie Mahoney a vaudeville act c...
89,Wings,1927,2,7.8,144,Drama,Romance,January,Two young men one rich one middle class who ar...

In [10]:
# lets check the shape of the data
df.shape

(90, 9)

In [9]:
# lets get some descriptive stats
df.describe().T

,count,mean,std,min,25%,50%,75%,max
year,90.0,1972.444444,26.216948,1927.0,1950.25,1972.5,1994.75,2017.0
nominations,90.0,8.988889,2.671087,1.0,7.00,9.0,11.00,14.0
rating,90.0,7.858889,0.590352,6.0,7.60,8.0,8.20,9.2
duration,90.0,138.033333,31.231089,90.0,118.00,128.5,158.75,238.0

In [11]:
# lets check the datatypes
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 90 entries, 0 to 89
Data columns (total 9 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   name         90 non-null     object
 1   year         90 non-null     int64
 2   nominations  90 non-null     int64
 3   rating       90 non-null     float64
 4   duration     90 non-null     int64
 5   genre1       90 non-null     object
 6   genre2       81 non-null     object
 7   release      89 non-null     object
 8   synopsis     90 non-null     object
dtypes: float64(1), int64(3), object(5)
memory usage: 6.5+ KB

In [12]:
# lets see if we have any null values
df.isnull().sum()

name           0
year           0
nominations    0
rating         0
duration       0
genre1         0
genre2         9
release        1
synopsis       0
dtype: int64

In [20]:
# lets get value count for some of these coulumns of objectdatatype
for col in df.columns:
    if df[col].dtype == 'O':
        print(df[col].value_counts())
        print()
        print(f'The value count for {col}')

Mrs. Miniver             1
Grand Hotel              1
Million Dollar Baby      1
Spotlight                1
A Man for All Seasons    1
                        ..
Crash                    1
Gigi                     1
The Apartment            1
From Here to Eternity    1
12 Years a Slave         1
Name: name, Length: 90, dtype: int64

The value count for name
Drama        37
Biography    16
Comedy       14
Crime         9
Adventure     8
Action        2
Musical       2
Fantasy       1
Western       1
Name: genre1, dtype: int64

The value count for genre1
Drama        42
Romance      18
Family        4
Crime         4
War           3
Sport         2
Comedy        2
Film-Noir     1
Western       1
Mystery       1
Musical       1
Biography     1
History       1
Name: genre2, dtype: int64

The value count for genre2
December     18
October      13
November     11
January      10
February      8
April         6
May           6
June          5
August        5
September     3
July          2
March         2
Name: release, dtype: int64

The value count for release
A manipulative Southern belle carries on a turbulent affair with a blockade runner during the American Civil War.                                                                                                               1
The story of Thomas More who stood up to King Henry VIII when the King rejected the Roman Catholic Church to obtain a divorce and remarriage.                                                                                   1
During the Iraq War a Sergeant recently assigned to an army bomb squad is put at odds with his squad mates due to his maverick way of handling his work.                                                                        1
Retired Old West gunslinger William Munny reluctantly takes on one last job with the help of his old partner and a young man.                                                                                                   1
A young F.B.I. cadet must confide in an incarcerated and manipulative killer to receive his help on catching another serial killer who skins his victims.                                                                       1
                                                                                                                                                                                                                               ..
At the close of WWII a young nurse tends to a badly-burned plane crash victim. His past is shown in flashbacks revealing an involvement in a fateful love affair.                                                               1
In 20th-century colonial Kenya a Danish baroness/plantation owner has a passionate love affair with a free-spirited big-game hunter.                                                                                            1
Ted Kramers wife leaves her husband allowing for a lost bond to be rediscovered between Ted and his son Billy. But a heated custody battle ensues over the divorced couples son deepening the wounds left by the separation.    1
The incredible story of Wolfgang Amadeus Mozart told by his peer and secret rival Antonio Salieri - now confined to an insane asylum.                                                                                           1
An in-depth examination of the ways in which the U.S. Vietnam war impacts and disrupts the lives of people in a small industrial town in Pennsylvania.                                                                          1
Name: synopsis, Length: 90, dtype: int64

The value count for synopsis